# -*- coding: UTF-8 -*-

a = "Hello World"
print("格式化多个字符：", "%s" % a)

a = "H"
print("%c只能格式化单个字符：", "%c" % a)

a = 8
print("格式化整数：", "%d%%" % a)

a = 8.888888
print("格式化浮点数，保留2位小数：", "%.2f" % a)

a = 8.888888
print("格式化成整数：", "%+u" % a)

a = 8.888888
print("转换成科学计数法：", "%e" % a)

a = 8.888888
b = 9.999999
print("第一个数：%s，第二个数：%s" % (a, b))


'''
%c: 转换为字符以及ASCII码
%s: 优先使用str函数进行转换
%d 或 %i: 转换为有符号十进制数
%f 或 %F: 转换为浮点数
%u: 转换为无符号十进制数
%o: 转换成无符号八进制数
%x 或 %X: 转换成无符号十六进制数
%e 或 %E: 转换成科学计数法
%g 或 %G: %f(F)和%e(E)的简写
%%: 输出%
'''